<template>
  <div id="scroll-board">
    <dv-border-box-4 :reverse="true">
      <div class="ranking-board-title" style="margin-top: 20px;font-size: 20pt; width: 100%; color: #ccc; LINE-HEIGHT: 100%; font-family: 华文楷体">企业基本信息</div>
      <dv-scroll-board  style="height: 95%" :config="config" />
    </dv-border-box-4>
  </div>
</template>

<script>
  export default {
    name: 'ScrollBoard',
    data () {
      return {
        config: {
          header: ['企业名称', '注册资本', '成立日期', '经营状态','企业类型','企业类别'],
          data: [
            ['aaaa1', '500,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa2', '100,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa3', '20,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa4', '30,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa5', '40,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa6', '10,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa7', '30,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa8', '510,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa9', '510,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa10', '5,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa11', '5,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
            ['aaaa12', '5,0000', '2015-07-02','在营（开业）企业','有限责任公司分公司(自然人投资或控股)','私营企业'],
          ],
          index: true,
          columnWidth: [50, 80, 100,100,150,250,100],
          align: ['center'],
          rowNum: 8,
          headerBGC: '#fffff',
          headerHeight: 100,
          oddRowBGC: '#fffff',
          evenRowBGC: '#fffff'
        }
      }
    }
  }
</script>

<style>
  #scroll-board {
    width: 95%;
    height: 100%;
    margin-top: 10px;
    margin-right: 5px;
    overflow: hidden;
  }
</style>
